In [4]:
import numpy as np
import pandas as pd

In [5]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [7]:
df=pd.DataFrame(np.arange(10,22).reshape(3,4), index='a b c'.split(), columns='A B C D'.split())
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [8]:
#loc 인덱서: 인덱싱 값을 하나만 받는 경우
df.loc['a']
#출력 결과: 시리즈로 반환

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [9]:
#에러 예제
df.loc['A']

KeyError: 'A'

In [10]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [11]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [13]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [14]:
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [15]:
#b행을 출력: 시리즈 형태
df.loc['b']

A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [16]:
#b행을 출력: df 형태
df.loc[['b']]

    A   B   C   D
b  14  15  16  17

In [17]:
##컬럼명에 B,C가 존재
df[['B','C']]

    B   C
a  11  12
b  15  16
c  19  20

In [18]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [19]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [22]:
df[df.A>15]

    A   B   C   D
c  18  19  20  21

In [23]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [24]:
#함수 작성
def sel_row(df):
    return df.A>15


#True나 False가 반환

In [25]:
#함수 호출 인덱싱
sel_row(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [26]:
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

In [28]:
df2=pd.DataFrame(np.arange(10,26).reshape(4,4), columns='a b c d'.split())
df2
#행 인덱스 지정하지 않아서 0부터 1씩 증가되는 정수 인덱스 자동 생성

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [29]:
#값 인덱싱-슬라이싱초기값:끝값
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [30]:
#위치 인덱싱-슬라이싱 초기위치:끝위치+1
df2[1:2]

    a   b   c   d
1  14  15  16  17

In [31]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [32]:
#a형의 A열
df.loc['a','A']

10

In [35]:
#loc를 사용한 원소값 변경
#df.loc
df.loc['a','A']=50
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [36]:
df.loc['a'] #시리즈로 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [37]:
df.loc[['a']] #데이터 프레임으로 반환

    A   B   C   D
a  50  11  12  13

In [38]:
df.loc['a',:] #시리즈로 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [39]:
df
df.loc['a','B':'C']

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [40]:
#b행부터 모든 행의 A열
df.loc['b':,'A'] 

#시리즈 형태 반환

b    14
c    18
Name: A, dtype: int32

In [41]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [50]:
df.loc[['a','b'],['B','D']]

    B   D
a  11  13
b  15  17

In [58]:
df.loc['a':'b']
df.loc[['a','b']]
df.loc[['a','b'],'B']
df.loc['a':'b','B']
df.loc['a':'b',['B','D']]
df.loc[['a','b'],['B','D']]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

a    11
b    15
Name: B, dtype: int32

a    11
b    15
Name: B, dtype: int32

    B   D
a  11  13
b  15  17

    B   D
a  11  13
b  15  17

In [59]:
#df 데이터프레임의 a,c행의 B,D열을 출력하시오(df로 반환)
df.loc[['a','c'],['B','D']]

    B   D
a  11  13
c  19  21

In [60]:
df.loc[:"b","B":"D"]

    B   C   D
a  11  12  13
b  15  16  17

In [61]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [62]:
#0행 1열 
df.iloc[0,1]

11

In [63]:
#0행1열:df형태로 반환-슬라이싱 사용
df.iloc[0:2,1:2]

    B
a  11
b  15

In [64]:
#0행1열:시리즈 형태로 반환 - 슬라이싱,위치값 사용
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [65]:
#0행의 2번째 열부터 끝열까지 반환
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [69]:
#0행의 끝에서 두번째 열 이후까지 반환
df
df.iloc[0,-2:] #시리즈 형태로 반환
df.iloc[0:1,-2:] #데이터프레임 형태로 반환

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

C    12
D    13
Name: a, dtype: int32

    C   D
a  12  13

In [ ]:
#iloc[행치,열위치] > 원소값 반환
#iloc[행위치1:행위치2,열위치1:열위치2]>원소반환: df반환
#iloc[행위치,열위치1:열위치2]>원소반환: 시리즈 반환
#iloc[행위치1:행위치2,열위치]>원소반환: 시리즈 반환

In [73]:
df55=pd.DataFrame(np.arange(25,50).reshape(5,5),index='a b c d e'.split(),columns='A B C D E'.split())
df55

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [76]:
df55['A']

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [91]:
df55.loc['a':'c']
df55[0:3]
df55.iloc[0:3,0:5]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [93]:
#1행의 3,4열 추출
df55.iloc[1:2,3:5]
df55[['D','E']][1:2]

    D   E
b  33  34

    D   E
b  33  34

In [100]:
#a행에서 c행까지 중 B열과 D열 추출
df55.iloc[0:3,[1,3]]
df55.loc[['a','b','c'],['B','D']]
df55.loc['a':'c',['B','D']]
df55.iloc[:3,[1,3]]

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38

In [ ]:
# A열 추출
dfp['A'] # 시리즈형태
dfp.loc[:]['A'] # 시리즈형태
dfp.loc[:,:'A'] # 데이터프레임 형태
dfp.iloc[:,:1] # 데이터프레임 형태
dfp.iloc[:,0] # 시리즈형태

In [ ]:
- iloc[행위치,열위치] -> 원소값 반환
- iloc[행위치1:행위치2,열위치1:열위치2] -> 원소 반환: df 반환
- iloc[행위치,열위치1:열위치2] -> 원소반환 :시리즈 반환
- iloc[행위치1:행위치2,열위치]->원소반환 : 시리즈 반환